<?php

use Illuminate\Contracts\Http\Kernel;
use Illuminate\Http\Request;

define('LARAVEL_START', microtime(true));

/*
|--------------------------------------------------------------------------
| 檢查維護模式
|--------------------------------------------------------------------------
|
| 此檔案將檢查應用程式是否處於維護模式
| 如果是，它將載入此檔案，以便維護模式可以
| 具有完全自訂和美觀的範本。
|
*/

if (file_exists($maintenance = __DIR__.'/../storage/framework/maintenance.php')) {
    require $maintenance;
}

/*
|--------------------------------------------------------------------------
| 註冊自動載入器
|--------------------------------------------------------------------------
|
| Composer提供了一個方便的、自動產生的類別載入器
| 對於這個應用程式。我們只需要使用它！我們將簡單地要求它
| 進入腳本，這樣我們就不必手動載入任何類別。
|
*/

require __DIR__.'/../vendor/autoload.php';

/*
|--------------------------------------------------------------------------
| 執行應用程式
|--------------------------------------------------------------------------
|
| 一旦我們有了應用程式，我們就可以處理傳入的請求
| 透過核心，並將關聯的回應傳送回
| 客戶端的瀏覽器，讓他們享受創建的應用程式。
|
*/

$app = require_once __DIR__.'/../bootstrap/app.php';

$kernel = $app->make(Kernel::class);

$response = $kernel->handle(
    $request = Request::capture()
)->send();

$kernel->terminate($request, $response);