<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 視圖存儲路徑
    |--------------------------------------------------------------------------
    |
    | 大多數模板系統會從磁碟載入模板。在這裡您可以指定
    | 視圖存儲在磁碟上的位置陣列。
    |
    */

    'paths' => [
        resource_path('views'),
    ],

    /*
    |--------------------------------------------------------------------------
    | 編譯視圖路徑
    |--------------------------------------------------------------------------
    |
    | 此選項決定所有編譯的 Blade 模板將存儲在何處
    | 為您的應用程式。通常，這在存儲目錄中。但是，
    | 如您所願，您可以隨意更改此位置。
    |
    */

    'compiled' => env(
        'VIEW_COMPILED_PATH',
        realpath(storage_path('framework/views'))
    ),

];